/*************************************************************************
						C语言学习笔记
 ************************************************************************/

1.指针与数组

计算机内存分布
{
高位	  操作系统内核->


		栈->保存当前程序的执行情况，函数调用，变量的值这些临时的，变化的东西
			
			当然栈还有个特点就是先进后出，函数的压栈，弹栈，程序入口
			所以最先分配的函数地址要大点

			用户可以分配的内存->


		堆->


		数据段-> 

低位     代码段->

}


变量：
变量的本质就是一个代号，不同类型的变量用来标记多大数量的内存为什么，为这段内存贴个标签，能进行什么操作，


内存分配地址空间的时候，编译器会做一定的优化，为了提高效率，同一类型变量内存分布的一致性

函数指针：
指针指向的地址是代码段的函数,一个函数一般是有若干代码组成




how to study C programe ?



















