#include <stdio.h>
#include <string.h>
typedef  struct lrc{
	int m_time;
	char lrc_buf[200];
	struct lrc *front;
	struct lrc *next;
}LRC;

int msg_deal(char *msg_src,char *msg_done[],char *str)
{
	int i=0;
	msg_done[i]=strtok(msg_src,str);
	while(msg_done[i]!=NULL)
	{
		i++;
		msg_done[i]=strtok(NULL,str);
	}
	return i;
}




int main()
{
	
	int time_buf[5];
	int i=0,j,k,temp=0;
	char *str;
	int min,sec;
	LRC *head=NULL,*p_new,*pb;
	char *q[100];
	int len=0;
	char lrc_buf[]="[ti:简单爱]\r\n\
[ar:周杰伦]\r\n\
[al:范特西]\r\n\
[by:大脸猫]\r\n\
[00:04.41]周杰伦 Chow, Jay Jou\r\n\
[00:07.41]aaaaaaaaaaa\r\n\
[00:10.56]简单爱(台视Star blue蓝星主题曲)\r\n\
[00:15.56]bbbbbbbbb\r\n\
[00:18.48]词：徐若瑄 曲：周杰伦\r\n\
[00:24.51]cccccccccccc\r\n\
[00:26.44]说不上为什么 我变得很主动\r\n\
[00:31.37]若爱上一个人 什么都会值得去做\r\n\
[02:04.94][00:36.09]我想大声宣布 对你依依不舍\r\n\
[02:09.97][00:41.26]连隔壁邻居都猜到我现在的感受\r\n\
[02:14.94][00:46.17]河边的风 在吹着头发 飘动\r\n\
[02:19.80][00:51.25]牵着你的手 一阵莫名感动\r\n\
[02:24.61][00:55.86]我想带你 回我的外婆家\r\n\
[02:28.32][00:59.79]一起看着日落 一直到我们都睡着\r\n\
[03:34.64][02:34.71][01:05.83]我想就这样牵着你的手不放开\r\n\
[03:39.68][02:39.34][01:10.71]爱能不能够永远单纯没有悲哀\r\n\
[03:44.27][02:43.90][01:15.44]我想 带你骑单车\r\n\
[03:46.74][02:46.60][01:18.05]我想 和你看棒球\r\n\
[03:49.77][02:49.58][01:20.71]想这样没担忧\r\n\
[03:51.61][02:51.59][01:22.69]唱着歌 一直走☆\r\n\
[03:54.38][02:54.35][01:25.57]我想就这样牵着你的手不放开\r\n\
[03:59.19][02:59.01][01:30.41]爱可不可以简简单单没有伤害\r\n\
[04:03.77][03:03.73][01:35.04]你 靠着我的肩膀\r\n\
[04:06.33][03:06.26][01:37.49]你 在我胸口睡着\r\n\
[04:09.13][03:09.34][01:40.57]像这样的生活\r\n\
[04:11.36][03:11.26][01:42.66]我爱你 你爱我★\r\n\
[03:13.76][01:44.97]想～～～ 简！简！单！单！ 爱～～～\r\n\
[03:23.61][01:54.30]想～～～ 简！简！单！单！ 爱～～～";
	len=msg_deal(lrc_buf,q,"\r\n");
	
	
	for(k=4;k<len;k++)//处理第5行到最后一行
	{
		str=q[k];
		i=0;
		while(*str=='[')
		{
			
		}
		for(j=0;j<i;j++)
		{
			
			
		}
	}
	while(1)
	{
		sleep(1);
		temp++;
		
		//按temp查找节点 调link_search_time  
 		//找到打印
	}
	
	//link_print(head);
	
	return 0;
}