/*************************************************************************
	> File Name: test.c
	> Author: llb
	> Mail: llb1008x@126.com 
	> Created Time: 2017年08月07日 星期一 19时07分02秒
 指针数组
 数组的指针
 数组元素的指针
 ************************************************************************/
 
#include<stdio.h>

int a[3][5]={
			{1,3,5,7,10},
			{9,11,13,15},
			{17,19,21,22}
			};

int main()
{
#if 1
	char i;
	int (*p)[5]=a;
	
	for(i=0;i<5;i++){
	
		printf("%d\n",*(p[0]+i));
	}
	
	printf("\n");
	for(i=0;i<5;i++){
	
		printf("%d\n",*(p[1]+i));
	}
	
#else
	int a[6]={1,2,3,5,4,6};
	int (*p)[5]=&a;
	
	printf("%d\n",*((int *)(p+1)-1) );
#endif

	return 0;
}
