/*************************************************************************
	> File Name: test.c
	> Author: 
	> Mail: 
	> Created Time: 2019年01月10日 星期四 11时41分51秒
	
	
输出50以内素数之和
 ************************************************************************/


#include <stdio.h>

int main()
{
    int m, n;
    for(m=2; m<=50; m++)
    {
		for(n=2; n<m; n++)
        {
            if(m%n == 0 )       //什么条件下跳出当前循环
                   break;                //这里应该退出当前循环了
		}	
        if(m == n)   //n循环结束后，如果m=n的话就输出m
            printf("%d  ", m);
	}
	printf("\n");
	
	return 0;    
}
