/*************************************************************************
	> File Name: leap_year.c
	> Author: llb
	> Mail: llb1008x@126.com
	> Created Time: 2017年05月20日 星期六 21时52分22秒
 ************************************************************************/
/************************************************************************
*
*任意给出一个年、月、日，判断是这一年的第几天:
*闰年算法：能被4整除且不能被100整除，或者能被400整除
*如：2012 5 10 是这一年的第131天
*提示：使用数组的方式计算，将每月的天数放在一个数组中*
*
* ***********************************************************************/

#include <stdio.h>

/*********************************************************
*函数：判断是否是润年
*参数：输入的年份
*返回值：是或不是
* *******************************************************/
int leap_year(int year)
{
    if( ((year%4==0)&&(year%100!=0))||(year%400==0) ){

        return 0;
    }else {

        return -1;
    }
}

/*******************************************************
*函数：这是这一年的第多少天
*参数：输入的年，月，日
* ******************************************************/
/*
int number_day(int year,int month,int day)
{
    

}
*/

int main()
{
    int year=0,day=0,ret=0,i=0,sum=0;
    int month[12]={31,28,31,30,31,30,31,31,30,31,30,31};
    
    printf("请输入年，月，日\n");
    scanf("%d %d %d",&year,&i,&day);

    ret=leap_year(year);
    if(ret==0){
        month[1]+1;    
        printf("是润年\n");
    }else{

        printf("不是润年\n");
    }
    
    for(ret=0;ret<i-1;ret++){
        
        sum += month[ret];
        printf("sum->%d\n",sum);
    }

    sum += day;
    printf("这是这一年的第%d天\n",sum);

    return 0;
}
