电容屏项目函数与宏说明：

【内核函数】

/**********************************************************
**函数：container_of(ptr, type, member)
**功能：通过已知的结构中某个变量的指针获取结构体本身的指针
**参数：参数1——已知的某个变量指针
**	    参数2——结构体类型
**	    参数3——对应参数1指针的变量名
**返回值：结构体本身指针
**提示：当参数3的变量为指针类型时，不建议使用该函数 
		可选择【提示函数】
***********************************************************/

/**********************************************************
**函数：int gpio_request(unsigned gpio, const char *label)
**功能：向内核申请使用某个gpio
**参数：参数1——要申请的哪一个管脚
**	    参数2——名字
***********************************************************/

/**********************************************************
**函数：int gpio_direction_output(unsigned gpio, int value)
**功能：把某个gpio设置为输出，且设置电平为value
**参数：参数1——要设置的管脚
**	    参数2——电平值
***********************************************************/

/**********************************************************
**函数：gpio_to_irq()
**功能：把gpio口转化成对应的中断号
**参数：gpio口
**返回值：中断号	    
***********************************************************/

【项目封装函数】

/**********************************************************
**函数：goodix_init_panel()
**功能：电容屏初始化配置函数 
		其实就是把54个字节的命令数据写入，配置寄存器
***********************************************************/

/**********************************************************
**函数：goodix_read_panel()
**功能：读取电容屏原始坐标
		定义35个字节数组并初始化为0。坐标数据从0地址开始读取，
		数组的首字节作为寄存器地址，真实数据是保存在后34字节。
***********************************************************/

/**********************************************************
**函数：goodix_analysis_data \
	(uint8_t *point_data, struct goodix_priv *goodix,  \
			pos_t pos, unsigned int *pressure)
**功能：分析原始坐标 得到最终坐标值 存于pos
***********************************************************/

【提示函数】

/**********************************************************
**	i2c_set_clientdata()
**	i2c_get_clientdata()
***********************************************************/
	
	


