#ifndef IP_PTHREAD_H
#define IP_PTHREAD_H

#include "recv_net_data.h"

/******************************************************************
函数功能:	根据目的ip查找网卡,确定发送数据的网卡号
参    数:	目的IP
返 回 值: 	网卡号
*******************************************************************/
extern int find_network_num(unsigned char *ip);

/******************************************************************
函数功能:	发送ARP请求包获取mac
参    数:	void *arg 待转发的数据
返 回 值:	无
*******************************************************************/
extern void send_arp_ask(RECV_DATA *arg);

/******************************************************************
函数功能:	转发icmp包
参    数:	void *arg 待转发的数据
返 回 值:	无
*******************************************************************/
extern void transpond_icmp(RECV_DATA *arg);

#endif
