#ifndef TFTP_DEAL_H
#define TFTP_DEAL_H

/******************************************************************
功	能:	上传/下载处理线程
参	数:	无
返回值: 无
*******************************************************************/
extern void tftp_deal();

/******************************************************************
功	能:	下载文件
参	数:	下载的目的ip地址，待下载的文件名称
返回值: 无
*******************************************************************/
extern void download(char *ip, char *file_name);

/******************************************************************
功	能:	上传文件
参	数:	上传的目的ip地址，待上传的文件名称
返回值: 无
*******************************************************************/
extern void upload(char *ip, char *file_name);

#endif
