　


电芯的简介

　　充电电池的组成是这样的：电芯+保护电路板。充电电池去除保护电路板就是电芯了。他是充电电池中的蓄电部分。电芯的质量直接决定了充电电池的质量。

　　手机电板拆掉外壳，再去掉电板里的保护电路板就剩下锂电芯了。

　　充电电池是由电芯+保护电路板+胶壳+绝缘辅料+相关配件组成。其中电芯起主导作用。
　　电芯的分类

　　电芯共分为6大类：镍氢、镍镉、锂电、聚合物、铅酸、储电

　　各电芯的单个电压：镍氢、镍镉为1.2V 。锂电、聚合物为3.7V 铅酸为1.5V 储电芯的电压较多 通常有5V 9V 12V…..等。

　　电芯区别：1. 镍氢、镍镉电芯从外观上没什么区分，其主要区分为重量 容量，镍镉电芯较轻。镍氢、镍镉电芯的型号在电池领域通常用AAAA, AAA, AA, A ,SC,C,D,N,F等来说明AA就是
我们通常所说的5号电池，尺寸为：直径14mm，高度49mm; AAA就是我们通常所说的7号电池，尺寸为：直径11mm，高度44mm。以上两类市面上有买，其它型号大部分则是用于制作电子产品电池。
镍镉电芯说明：镍镉电芯有两个极板组成，一个是用镍做的，另一个是用镉做的，这两种金属在电池中发生可逆反应，因此电池可以重新充电。镍镉的优点是“结实” 重量轻、价格便宜。缺点是镉金
属对环境有污染，电池容量小，寿命短，所以镍镉电池是最低档的电池，有记忆效应，每次充电都必须先放电，否则他的记忆功能将大大降低手机的充电量，只有将电池的余电放净后再进行充电才
能保持电池的充电量。镍氢电池： 镍氢电芯是有氢离子和金属镍合成，电量储备比镍镉电池多30%，比镍镉电池使用寿命也更长，并且对环境无污染，无记忆效应。镍氢电池的缺点是价格镍镉电池
要贵、重量比镍镉重，容量比锂电池要低，但好处是不会因过充过放导致电芯爆炸。

　　锂电芯分为两类：一类为锂电钢壳电芯，另一类是锂电铝壳电芯，同型号的电池铝壳重量比较，钢壳重，铝壳的容量较高。由于钢壳和铝壳的内部结构不同，所以壳体所表现出来的正负极也存
在着差别，钢壳电池的外壳为负极，顶部了为正极：而铝壳的电极恰好与钢壳的相反，外壳为正，顶部为负极。两种电池在内阻和电压方面没有很大的分别。

　　电芯主要特点粒径小，比较面积大，颜色白，纯度高，电化学性能明显提高。可以用到钛酸锂电池材料和钴酸锂电池材料中。

　　1：在-0.05～0.35V(vs SCE)的电位范围内表现出典型的法拉第赝电容行为。所谓赝电容是继双电层电容器后，发展了得赝电容器。赝电容也称法拉第准电容，对于法拉第准电容, 其储存
电荷的过程不仅包括双电层上的存储, 而且包括电解液中离子在电极活性物质中由于氧化还原反应而将电荷储存于电极中。电解液中的离子, 一般为H或OH- 在外加电场的作用下由溶液中扩散到
电极/溶液界面，而后通过界面的电化学反应而进入到电极表面活性氧化物的体相中;由于电极材料采用的是具有较大比表面积的氧化物，这样就会有相当多的这样的电化学反应发生，大量的电荷就
被存储在电极中。放电时这些进入氧化物中的离子又会重新返回到电解液中，同时所存储的电荷通过外电路而释放出来，这就是法拉第准电容的充放电机理。说明白点，赝电容就是无数个小的双电
层电容。

　　2：在相同的电流密度(毫安/平方厘米)下，增加比容量(发/克)。

　　3：降低自放电率，具有量好的循环寿命。成分：纳米二氧化钛(XZ-TI01)外观 ：白色粉末状; PH 值： 6-8 ;粒径： 10 纳米;比表面积： 60-70 m2/g ;纯度：99.9%，干燥失重105℃
    、2h ≤ 0.05(%);灼烧失重 ≤0.1(%);铁ppm ≤3 合格铅(Pb) ppm ≤10 合格。包装 ： 10公斤/纸桶内衬塑料薄膜袋
　　移动电源电芯的类型与优劣

　　18650电芯

　　其中进口18650电芯一般使用的都是三洋，三星、松下、索尼等大厂家生产的，这些厂家的产品经过了市场检验，且厂家具有一定的技术实力，所以产品质量相对较高。

　　国产18650电芯是国内品牌厂商生产的电芯，在国内也有很多厂家都有生产18650电芯，例如比亚迪、比克、邦凯、神力等，不能否认有些厂家的产品优秀，但总体水平和国外还有一定差距。

　　拆机18650电芯这种电芯是最差劲的，从字面上就可以看出是拆出来的，一般这种的电芯都是从以往的旧产品上拆下来又组装成的移动电源，这种的电芯无论是进口的电芯也好还是国产的也好
从安全性上都存在着一定的隐患。因此消费者在购买移动电源的时候需要谨慎，谨防购买到了由拆机18650电芯制造的移动电源。

　　聚合物电芯

　　聚合物电芯分为三种品质的，分别为A品、B品、C品

　　A品聚合物电芯是质量最好的全新聚合物电池，通常是电池厂家为客户定制而成，在质量上要求比较高，所有参数均能达标，无任何异常的产品。一般情况下大厂家的移动电源都会使用A品电芯。

　　B品聚合物电芯这种的电芯在生产过程中，因为一些原因会导致部分产品出现瑕疵，在外观、容量、电压或者其他参数上有少许问题，这样的产品称为B品。另外如果A品电芯存货时间过长，例如
3-6个月没有出货的产品，通常也会称之为B品。 B品在前1-2个月的使用上与A品的几乎没有区别，2个月后容量和循环次数将急剧下降。

　　C品聚合物电芯就好比18650电芯的拆机品，通常是淘汰下来的电芯，品质很差，通常在外观、容量、电压等指标上都不合格。这样的产品存在安全隐患，有其制作的移动电源不仅容量上存在问题
，很有可能导致数码设备的损坏。消费者购买是同样需要警惕。

　　移动电源电芯安全指数

　　说到移动电源电芯安全，不得不提的是以前发生过18650锂电池爆炸的移动电源属于个别和极端案例。但是笔记本电池就是通用的18650电芯，出现过的爆炸就听得比较多了。聚合物锂离子电池，
它的电极和隔模中都有胶体聚和物，呈现固态，用软壳封闭，因此不具有爆炸地危害性，前提是你不要故意把移动电源扔进火里，平常最坏的情况也就是聚合物电芯顶多把包装胀破而已，不会爆炸。
而18650电芯为圆柱状的锂电，那是用钢壳或铝壳封装的，如果哪天出故障，电芯产生大量气体，钢壳和铝壳可不是胀破那么简单了，那就是小炸弹一枚。因此聚合物电芯在安全性方面是高于18650
锂电池电芯的。

　　移动电源价格和品牌

　　按照消费者的消费观点，物美价廉的东西永远是最受欢迎的。但是在选择移动电源的时候一定不能抱有一点侥幸心理，认为花很少的钱就能买到质量很好的移动电源，这除非是优质厂家生产出来
的移动电源亏本甩卖，当然这种现象少之有又少。各种移动电源之间所使用的电芯类型和质量不尽相同，成本也有高有低。一个质量品质好的电芯及移动电源所花费的成本绝对不是街市作坊、及小工厂
生产出来的移动电源可比的。价格低廉的移动电源有很大部分是使用了低质量电芯，甚至可能是拆机18650电芯和C品聚合物电芯!消费者必须警惕这一点。因此在选择移动电源的时候宁可选择一些
大品牌、知名品牌，绝对不要选择三无的移动电源!




电芯的基本知识

　　一、正负极片在拉浆时，如果极片附料偏重或偏轻会有何影响呢?

　　答：1、在讲解此问题时，大家必须了解电池是如何组成的!!电池的主要组成部份是由：正极片、负极片、盖帽、壳(铝，钢)、电解液、密封圈及隔膜纸等组成。

　　2、电池的核心组成部份是由正极片及负极片组成。所以正负极片的附料直接影响着电池的性能。了解了电池的具体结构，再反过来了解正极片与负极片的构成、作用。

　　3、正极片是由：发泡镍(导电体)及正极化学原材料组成。负极片是由：钢带及负极化学原材料组成。简单的说就是将化学原材料通过拉浆将它紧紧的与发泡镍(钢带)连接在一起，就形成了
正极片(负极片)。

　　4、在电池组制作过程中有如下规律：负极片决定电池的稳定性能及过充(放)性能。正极决定电池的容量。如果电池在生产过程中，A：正极片偏轻则会导致电池“低容量”;B：正极片偏重则会
导致电池在充电过程中漏液、鼓底，若更严重则会导致电池爆炸;C：负极片偏轻则会导致电池在充电过程中漏液、鼓底，若更严重则会导致爆炸;D：负极片偏重则会影响电池在组装过程中难以入壳
，导致正负极片在入壳过程中报废或短路，另因负极片偏重导致电池原材料浪费而降低了电池的物料利用率。所以正负极片无论是偏轻与偏重都会对电池有较大影响。

　　二、极片的裁片刀为何要定期打磨?

　　答：在了解裁片刀为何要定期打磨时，首先须了解极片毛剌，毛刺是如何产生的呢!很简单，是因为极片在裁切过程中，由于刀刃不利或缺口，导致极板骨架与附料分离，而裸露在外面的部份
骨架称之为毛刺，如果此毛刺无法有效的处理，则易导致电池在组装过程短路。所以裁片刀需定期打磨保证刀刃的锋利，从而减少裁过程中产生的毛刺。

　　三、 镍网面密度对电池有何影响?

　　答：发泡镍最主要的作用是起到导电及吸附化学原材料的作用，所以发泡镍的面密度对电池的制作有一定的影响。A：发泡镍面密度越高，孔径就越密，所以电池的导电性能就越好。B：因发
泡镍密度较高，而导致化学原材料的填充量减少，使电池的容量无法达到工艺设计要求。C：由于发泡镍密度过高，极片在切片或运转过程中产生的毛刺就越多，所以也易导致电池在卷绕过程中短路。

　　所以我们在使用发泡镍时需严格按照工艺要求进行操作。

　　四、 压片有何做用?

　　答：极片压片的作用。1、将化学原材料紧紧的压在正负极骨架上，防止附料脱落。

　　2、将极片的厚度压薄后，有利于电池的入壳。所以我们在压片时，需严格控制极片的厚度。极片厚度若偏厚，则易导致电池在组将过程中难以入壳，导致电池组报废或短路。若极片厚度偏薄则
易将极片压变形或由于极片硬度过大，而导致电池在卷绕时出现短路。

　　五、 点焊极耳有何注意事项?

　　答：1、正极极耳是起到引流的作用，正极极耳材质与长短都将严重影响电池的组将及电池的性能。极耳的材料主要有两种：镍片与镀镍钢片。镍片的导电性很比镀镍钢片要好，镍片比钢片要软，
所以在使用时，必须注意不可将此两种材料混用。点焊极耳的长度若偏长则易导致电池在组装过程中出现短路。若极耳长度偏短则易导致组装车间在焊接盖帽时不易操作。固在点焊极耳时需严格按照
清粉槽位进行操作。

　　2、点焊时需注意是否有虚焊、炸火、焊点不均现象;其中每一项都将直接影响着电池的性能时否合格。虚焊、炸火则易导致电池高内阻及断路(即没有电压)，导致电池无没使用。焊点不均则会
影响极耳的点焊拉力。

　　极片点焊极耳是电池制造过程中非常关健的了道工序。

　　六、极片清粉有何作用?

　　答：极片清粉主要是为了方便于点焊极耳。在清粉过程中需注意极耳的槽位及清粉的干净度。若清粉槽位与工艺要求不符则易导致点焊极耳时的极耳外露无法控制。另若清粉槽位粉尘没有清干净
则易导致在点焊极耳时炸火或虚焊。

　　另在清粉时需注意将耳帽戴上，防止超声波刺激耳朵。

　　七、 电池正负极浆料固含量对电池何影响?

　　答：正负极浆料固含量计算公式如：(浆料干重+纸重)/(浆料湿重+纸重)*100%=浆料固含量。公式很简单，道理同样也很简单。例：100公斤水里面有20公斤汽油，则水的含量为80%。同理100
公斤浆料内有20公斤水，则浆料内固体化学物的比例为80%。若同样100公斤浆料内有水30公斤(10公斤)，则浆料内固体化学物的比例为70%(90%)。通过上面的数据可分析得出，水的份量越多，
固体化学物就越少。水的份量越少，固体化学物就越多。若在拉浆时按固体化学物按80%含进行生产，而实际固体化学物含量为70%(或90%)，则会导致拉浆极片偏轻(或偏重)。从而导致极片不合格，
严重影响电池的性能(容量偏低、漏液等)。

　　八、 贴胶布有何做用及需注意事项是什么?

　　答：正负极片贴胶布的主要作用为防止电池在组装过程中短路，其短路形式有两种：第一种现象为极耳与极片的焊接处刺破隔膜纸与负极片接触造成短路。第二种现象为极耳与盖帽焊接处在压
帽时与钢壳壁接触造成短路。也就说明贴胶布工序直接影响着后道工序是否能够正常进行(直接影响着电池后续生产的不良率)。所以我们在操作时需注意如下几点：A：贴布需完全盖住极耳与
极片的焊接处;B：贴胶布时极耳外露约在3-4mm之间(此种长度为组装过程中焊接盖帽的最佳长度，若超过或偏短均会影响着焊接盖帽工序的操作);C：不可将胶布贴斜且需紧贴在极耳上。

　　九、极片为何需要分档?

　　答：极片分档主要是将偏轻与偏重的极片挑出将相同档次的极片相匹配，防止电池出现混配现象，而影响电池的性能。其不同重量的极片混配对电池有影响可见(三、拉浆需注意事宜及极片偏重
与偏轻对电池有何影响?)，所以在操作此工序时需准确把握住极片的重量，严格按照工艺要求进行操作，不可粗心大意。

　　十、正极片为何需要软化?

　　答：极片软化主要是1、将极片四周的毛刺除去;2、将极片变软;减少电池在卷绕过程中的短路，在软化时需注意软化的方向必须是L1端先入软化机，若软化方向相反则会出现电池卷绕短路。
另需注意软化的纹路是否细致，若软化的纹路不够细致也易导致电池卷绕时短路。

　　十一、卷绕工序有哪些不良，分别有哪些影响?

　　答：卷绕时易出现如下不良：1、卷绕短路;2、正极偏高(偏低);3、负极偏高(偏低);4、正负极片报废;5、正极顶针;6、极蕊超高等。

　　1.卷路可分为：毛刺短路、直接短路。a.毛刺短路即为正极极片骨架外露且刺破隔膜纸造成的正负极接触短路，因此种短路无法或者是很难用肉眼看见，而且此短路在使用过程或跌落过程中都有可能产生，所以此种短路危险性超过电池直接短路。b.直接短路即为正负极片直接接触短路，导致此短路形成的原因为1、因隔膜纸长度不够，无法将正负极片隔开而导致正负极片直接接触;2、则是因正极片偏高(偏低)或偏低(偏高)与钢壳接触导致电池短路;

　　2. 极片偏高(偏低)或偏低(偏高)直接影响着电池的性能,a.若正负极片高或偏低则会降低电池的容量,使正负极化学原材料无法得到充分的利用;b.若正负极片严重偏高或偏低则会导致电池在封口后电池内部短路;

　　3.正负极片报废则是因为极片在卷绕的时候没有放好或是在修复电池时将正负极片折断，导致极片报废,若正极折断后没有发现装入钢壳内后,则会导致电池容量偏低,若负极片掉粉严重或断裂则会导致电池在充放电过程中漏液;

　　4.正极片顶针卷绕主要是由于操作不当所导致,正极顶针卷绕易导致正极顶针部份的极粉脱落,影响电池性能(如：自放电大、短路等);

　　5.极蕊超高有两种情况,一种情况是因正负极卷绕错位,负极片超出隔膜纸的宽度,导致卷绕极蕊超高,另一种情况则是因为操作人员卷绕完毕后未将极蕊敲入钢壳内,导致极蕊超高;

　　十二、冲槽应控制那些方面?

　　答：冲槽好坏直接影响着电池的封口,所以冲槽尺寸需严格控制,需注意的尺寸有(冲槽高度、冲槽外径、冲槽扩口),另外一方面则是电池外观(电池划伤、电池砸伤)等。

　　1.冲槽高度直接影响着封口总高,若冲槽偏矮则会导致电池超高或封口包边过少导致封口压力不够(封口压力不够易导致电池漏液),若冲槽偏高则会导致电池高度偏矮或因封口包边过多导致电池封口短路(钢壳与盖帽接触\电池极蕊受挤压导致内部短路);

　　2.冲槽外径直接影响着电池封口的密封性能,外径偏大则易导致电池在封口时封斜,若外径偏小则易导致电池裂槽(即冲槽位与钢壳壳体断裂)导致电池漏液;

　　3.冲槽扩口(扩口是冲槽径部在冲槽过程中扩大,有两种情况易导致此情况的发生,一是因为冲槽模头不配套,二则是因冲槽机尾模压力偏大)越小越好,若冲槽扩口偏大则易导致电池封口塌边,无法进行封口;

　　十三、涂油有何作用,需注意些什么?

　　答：涂油是为了确保电池密封效果的一道重要工序,将密封油均匀的涂在钢壳壁上可防止碱液向外爬出,所以在涂油时必须将密封胶均匀的涂在冲槽部份,另在涂油时尽量不要将钢壳壁搞脏,减少后
道工序清洗难度;

　　十四、点焊有那些不良,应如何控制?

　　答：将点焊极耳与盖帽焊接在一起主要是起到引流的作用，点焊时需注意是否有虚焊、炸火、焊点不均现象;其中每一项都将直接影响着电池的性能时否合格。虚焊、炸火则易导致电池高内阻及
断路(即没有电压)，导致电池无没使用。焊点不均则会影响极耳的点焊拉力; 十五、注液有何重用,需注意些什么?

　　答：碱液(碱液又被称之为电解液,起着传送电子的作用)是电池的主要组成部份之一,同时也可以说是起着催化剂的作用,它能够促使正负极片的化学物质相互发生反应,所以电解液的多少与密度
直接影响着电池的性能.若电池解偏多则易导致电池漏液,若偏少则易导致电池内阻增大,所以在注液时需严格控制好碱液的用量;

　　十八、电池的封口有何做用?应控制那些方面?

　　答:电池的封口代表的着电池的外观成形,所以在电池封口时需注意电池的高度、封口扩口、封口压力、封口封斜及封口外观等.电池的封口高度分为肩高与总高,肩高超度则易导致电池封口压力不够,总高超高则易导致客户无法放入相关模具内,封口扩口过大及封口压力不够均易导致电池爬碱,漏液,电池封口封斜则易导致电池短路\烧焦\漏液等;外观方面则需注意电池是否有凹凸现象,另是否有塌边现象;

　　十六、电池为何要陈化及化成,陈化及化成时需注意些什么?

　　答:电池的陈化及化成主要是激活正负极化学物质,使它们能够充分的发生化学反应,将化学能转化为电能,所以在陈化时需严格按照工艺要求的电流及时间进行充电;

　　十七、电池的分容是什么?有何重用?

　　答:分容就是将符合工艺设计要求的电池挑出,将不合格的筛选出来,筛选方法就是用相同的电流,在规定时间外就以放电完毕的电池为不合格的,否则就有合格的!所以在分容时必须严格控制好电池
的放电时间,若放电时间长的电池与放电时间短的电池组合在一起则易出现漏液现象,同时也会减少电池的循环寿命;

　　十八、电池的放电倍率是什么?

　　答:电池的充放电电流往往用充电倍率来表示它是指电池的充放电电流为电池容量的某一个倍数.电池的容量除与制造工艺有关外,还与电池的充放电电流和充放电时间有关系.其容量计算公式为
 充放电容量(C)=充放电电流(A或MAH)*充放电时间(H)

　　如:SC型电池用1200MA(1.2A)放电到1.0V,其放电时间为58分钟,则该电池容量为1200MA(1.2)*58/60=1159.99MAH(或者说1.159AH) 注:时间单位分应换成小时

　　那么,在电池 充放电的时候,根据电池的设计和工艺要求,往往设计一定的充放电制度,而且电池型号多样.在规定放电流时,如直接说成电流值就很不方便.所以用放电倍率表示就方便的多.

　　如:AA600MAH镍镉电池,充放电制度要求用0.1C*90MIN,转

　　0.5C*150MIN那么我们就可以很快的得出充电电流即

　　0.1*600=60MA*45MIN转0.5C*150MIN=300*150MIN

　　从以上可以看出同一型号电池充放电倍率越大,电池充放电流就越大.

　　十九、电池的放电终止电压

　　答:电池在放电时终止电压一般为(1.0V,0.8V),终止电压值有时也不相同,这是为什么呢?放电终止电压是指电池在放电时,电压随着放电时间的增长而慢慢降低,当降到某一个点时,不能再继
续放电时的电压,也是电池最低的工作电压,这是人为规定的，对同一电池不同的放电条件要求也不同,一般为放电电流较小时终止电压稍高,放电电流较大时终止电压稍低,如我们一般使用的放电
制度0.2C,1C放电1.0V终止。而且10C放电时终止电压为0.8V.

　　二十、电池的过充电与过放

　　答：电池的过充是指电池在充电时,充电容量到达实际的容量后,仍继续充电的现象,它分为允许过充电和不允许过充电,由于电池的设计结构与工艺不同,电池的充电效率也有高有低,所以电池
按100%的容量充电时,就不会放出额定的容量,根据设计要求不同,电池在充电时

　　就会充到额定容量的120%--150%.如:我们1200mah的电池在分容充电时按公式计算充60分钟即达到标称的容量了，而实际上充90分钟。电池才能充足电，这是由于电池充足电后极板上的活性
物质量不断转化，电压也不断上升，当化学活性物质全部转化完后，电压就急剧上升，开始转化电解H2O，同时正极有02产生，负极有H2析出，为了避免大量的气体产生，电池就再不能继续充电，如
充电电池内压升高，大于防爆球压力，电池就会漏液爆炸。在刚好充足电这一点以上的充电称允许过允电，此点以后的充电称为不允许过充电，我们平时的规定的充电时间，就是接近这一点，超过规
定充电时间的称为过充电。 电池的过放电，是指电池放电时，达到终止电压(最低工作电压)后仍继续放电的现象，电池产生过放后，电压即在很短的时间内大幅度下滑，并达成负数，这时整个电池
内部反应体系发生紊乱，如再反复的过放，正极极就会失去活性，会影响电池的使用寿命。

　　二十一、电池的化成与分容

　　答：电池的化学性物质，在没有化成(活化)之前，活化极低落。，导电性也极低，在加入电解液后，要经过反复的充放电，使电池极板激活，电解液充分的吸附到极板的每一个部位，这样电池
的容量才能逐渐提高，化学活性物质才能不断的活化，并增加其化学活性物质的利用率，电池的容量才能不断的提高，所以电池在没有经过活化没有电能，这便是电池的化成(活化)目的。

　　由于电池在从极片到装配的整个过程中，都有因素影响电池的容量，同样生产工艺的电池性能也不一样。分容便是一个分级优选的过程，把电池分成几个档次，以便针对不同的客户要求和使用
场所发货使用。

